#!/usr/bin/env python
# Funtion:      
# Filename:

# 显示颜色格式：\033[显示方式;字体色;背景色m......[\033[0m]
# -------------------------------------------
# 字体色     |       背景色     |      颜色描述
# -------------------------------------------
# 30        |        40       |       黑色
# 31        |        41       |       红色
# 32        |        42       |       绿色
# 33        |        43       |       黃色
# 34        |        44       |       蓝色
# 35        |        45       |       紫红色
# 36        |        46       |       青蓝色
# 37        |        47       |       白色
# -------------------------------------------
# -------------------------------
# 显示方式     |      效果
# -------------------------------
# 0           |     终端默认设置
# 1           |     高亮显示
# 4           |     使用下划线
# 5           |     闪烁
# 7           |     反白显示
# 8           |     不可见
# -------------------------------

print('red:\033[32;1mred\033[0m')   #\033[31;1mstr\033[0m
print('\033[35;1mhello\033[0m')
salary = 100
print('Your cash-strapped now, the rest of your salary is \033[31;1m %s \033[0m' % (salary))